doc/README.org
#+TITLE: Analyse des performances et optimisation d'un outil pour casser des signatures de mots de passes
#+AUTHOR: yaspr

* Introduction 
  
  Dans le monde du service numérique, un fournisseur doit garantir aux utilisateurs des accès sécurisés aux
  services distants proposés. Cette garantie de sécurité repose généralement sur le déploiement de protocoles
  et algorithmes cryptographiques qui permettent de rendre inintelligibles - pour l'humain - les données
  secrètes durant leur transfert ou leur stockage afin de se prémunir contre les écoutes/interceptions et
  les fuites en cas d'intrusion. L'accès aux données claires étant réservé aux entitées 'légitimes' en
  possession des bonnes informations cryptographiques.
  
  Par exemple, pour accéder à vos courriels, vous devez vous connecter sur un des serveurs distants de votre fournisseur
  et fournir les informations d'identification enregistrées lors de la création de votre compte: *login* et *mot de passe*.
  Après vérification de la validité des informations fournies, vous êtes authentifié(e) par le serveur et les
  accès à la plateforme sont autorisés. Vous pouvez donc lire vos courriels!
  Comme vous l'avez probablement bien compris, l'authentification nécessite la vérification de données secrètes
  (le mot de passe) au niveau du serveur. Le serveur doit donc disposer d'un moyen cryptographique de vérification
  qui permette de garantir que le mot de passe de l'utilisateur ne soit pas divulgué.
  
  Dans les prochaines sections, nous allons regarder de plus prêt un mécanisme de stockage et de vérification de mots de passes
  qui fut considéré sécurisé dans le passé et qui, aujourd'hui, présente plusieurs failles majeures.
  Surtout avec la démocratisation des capacités de calcul et les avancées en terme d'attaques.
 
** Stockage et vérification des mots de passes
   
   Durant le processus d'enregistrement sur une plateforme à accès restreints, l'utilisateur choisit un identifiant et
   un mot de passe. À la fin de ce processus et après validation du formulaire d'inscription, le serveur utilise des primitives
   de hachage cryptographique (/hash functions/) pour génèrer une signature cryptographique (/hash/ ou /digest/ en anglais)
   *unique* et *non réversible* du mot de passe avant de la stocker avec le /login/ dans la base de données d'authentification.
   C'est cette signature qui sera utilisée pour vérifier si le mot de passe fourni est valide durant
   une tentative d'authentification. 
   
   La base de données d'authentification est généralement structurée comme suit:

   #+BEGIN_EXAMPLE

      [index] [user_login] [user_password_hash] [user_data_entry_index]
           1   yaspr        A98172BF...          1
	   2   michel       8CD1628B...          29
	   3   john         091E67F2...          1500
	   4   toto         F891DC67...          4
	     
   #+END_EXAMPLE
   
   
   À chaque tentative d'authentification, la base de données ci-dessus sera consultée afin de vérifier les informations
   d'identification fournies par l'utilisateur en utilisant une routine similaire à la suivante:
   
   #+BEGIN_SRC c

     u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
     {
       u64 index = 0;

       if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
	 {
	   u8 *user_password_hash = hash(user_password);

	   if (compare(user_password_hash, auth_tab[index]->user_password_hash) == 0)
	     return auth_tab[index]->user_data_entry_index;
	   else
	     return 0; //Login failure (wrong password)
	 }
       else
	 return 0; //Login failure (wrong login)
     }
     
   #+END_SRC

   Cette routine permet de vérifier si l'utilisateur existe dans la base de données d'authentification avant de
   vérifier si la signature (/hash/) du mot de passe fournit est identique à celle dans la base de données. En cas d'échec,
   cette routine retourne 0. Par contre, si les informations fournies sont valides, cette routine retourne l'index
   de l'emplacement des données de l'utilisateur dans la base de données des données utilisateur qui sera utilisé par
   une autre routine qui s'occupera de charger, décrypter et afficher les données utilisateur.
   
   À partir de cet exemple, on peut donc observer l'importance du hachage cryptographique dans la 'sécurisation' du stockage des données
   utilisateur secrètes et de l'authentification. On peut même être amené à supposer que nous avons trouvé la solution au problème
   et que notre système est protégé en cas de fuites. Supposition que plusieurs industriels et fournisseurs de services distants ont
   considérée valide et qui leur a coûté, et à leurs utilisateurs, très cher par la suite.
   
   Malheureusement, ce schéma de stockage ne protège pas les données des attaques de type /brute-force/ basées sur un dictionnaire
   de mots de passes ou sur des /rainbow tables/. Un attaquant avec suffisamment de resources de calcul et un dictionnaire bien élaboré
   pourra venir à bout de plusieurs signatures en l'espace de quelques heures ou même quelques minutes. Pire encore, les mots de passes
   similaires auront la même signature et il suffira de vérifier que la signature n'ait pas déjà été cassée, ce qui élimine tout calcul
   redondant et accélère encore plus le processus de /brute-force/.
   
   L'objectif de ce projet est donc d'analyser et d'optimiser les performances de l'outil *yHashCrack* qui permet
   de 'casser' de façon parallèle des signatures de mots de passes pour un algorithme donné (*MD5*, *SHA1*, *SHA256*, ...) en utilisant
   un dictionnaire.
   
