doc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-08 Mon 11:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Analyse des performances et optimisation d'un outil pour casser des signatures de mots de passes</title>
<meta name="author" content="yaspr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Analyse des performances et optimisation d'un outil pour casser des signatures de mots de passes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfe32c69">1. Introduction</a>
<ul>
<li><a href="#orgefac4f7">1.1. Stockage et vérification des mots de passes</a></li>
<li><a href="#org119a143">1.2. Algorithmes de hachage</a></li>
</ul>
</li>
<li><a href="#org7a7fd1f">2. Comment fonctionne yHashCrack ?</a></li>
<li><a href="#org1f8ccb4">3. Travail à faire</a>
<ul>
<li><a href="#org03c9a11">3.1. Analyse des performances</a></li>
<li><a href="#org8691d73">3.2. Optimisation</a></li>
</ul>
</li>
<li><a href="#org629a16f">4. Rendu</a></li>
<li><a href="#org2faef44">5. Conseils</a></li>
<li><a href="#org908c7dd">6. Bonus crypto</a>
<ul>
<li><a href="#orga080e89">6.1. Reality check &amp; rainbow tables</a></li>
<li><a href="#orga29eca9">6.2. Salt</a></li>
<li><a href="#org60f3fb1">6.3. Salt + pepper</a></li>
<li><a href="#orgb2d00a8">6.4. Autres techniques de stockage</a></li>
<li><a href="#orgc3de268">6.5. Comment chosir un mot de passe sécurisé?</a></li>
<li><a href="#org54677a2">6.6. Sécurité et comparaison des primitives</a></li>
</ul>
</li>
<li><a href="#org4125ee9">7. Références</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfe32c69" class="outline-2">
<h2 id="orgfe32c69"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Dans le monde du service numérique, un fournisseur doit garantir aux utilisateurs des accès sécurisés aux
services distants proposés. Cette garantie de sécurité repose généralement sur le déploiement de protocoles
et algorithmes cryptographiques qui permettent de rendre inintelligibles - pour l'humain - les données
secrètes durant leur transfert ou leur stockage afin de se prémunir contre les écoutes/interceptions et
les fuites en cas d'intrusion. L'accès aux données claires étant réservé aux entitées 'légitimes' en
possession des bonnes informations cryptographiques.
</p>

<p>
Par exemple, pour accéder à vos courriels, vous devez vous connecter sur un des serveurs distants de votre fournisseur
et fournir les informations d'identification enregistrées lors de la création de votre compte: <b>login</b> et <b>mot de passe</b>.
Après vérification de la validité des informations fournies, vous êtes authentifié(e) par le serveur et les
accès à la plateforme sont autorisés. Vous pouvez donc lire vos courriels!
Comme vous l'avez probablement bien compris, l'authentification nécessite la vérification de données secrètes
(le mot de passe) au niveau du serveur. Le serveur doit donc disposer d'un moyen cryptographique de vérification
qui permette de garantir que le mot de passe de l'utilisateur ne soit pas divulgué.
</p>

<p>
Dans les prochaines sections, nous allons regarder de plus prêt un mécanisme de stockage et de vérification de mots de passes
qui fut considéré sécurisé dans le passé et qui, aujourd'hui, présente plusieurs failles majeures.
Surtout avec la démocratisation des capacités de calcul et les avancées en terme d'attaques.
</p>
</div>

<div id="outline-container-orgefac4f7" class="outline-3">
<h3 id="orgefac4f7"><span class="section-number-3">1.1.</span> Stockage et vérification des mots de passes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Durant le processus d'enregistrement sur une plateforme à accès restreints, l'utilisateur choisit un identifiant et
un mot de passe. À la fin de ce processus et après validation du formulaire d'inscription, le serveur utilise des primitives
de hachage cryptographique (<i>hash functions</i>) pour génèrer une signature cryptographique (<i>hash</i> ou <i>digest</i> en anglais)
<b>unique</b> et <b>non réversible</b> du mot de passe avant de la stocker avec le <i>login</i> dans la base de données d'authentification.
C'est cette signature qui sera utilisée pour vérifier si le mot de passe fourni est valide durant
une tentative d'authentification. 
</p>

<p>
La base de données d'authentification est généralement structurée comme suit:
</p>

<pre class="example" id="org7305a77">

[index] [user_login] [user_password_hash] [user_data_entry_index]
     1   yaspr        A98172BF...          1
     2   michel       8CD1628B...          29
     3   john         091E67F2...          1500
     4   toto         F891DC67...          4

</pre>


<p>
À chaque tentative d'authentification, la base de données ci-dessus sera consultée afin de vérifier les informations
d'identification fournies par l'utilisateur en utilisant une routine similaire à la suivante:
</p>

<div class="org-src-container">
<pre class="src src-c">
u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
{
  u64 index = 0;

  if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
    {
      u8 *user_password_hash = hash(user_password);

      if (compare(user_password_hash, auth_tab[index]-&gt;user_password_hash) == 0)
        return auth_tab[index]-&gt;user_data_entry_index;
      else
        return 0; //Login failure (wrong password)
    }
  else
    return 0; //Login failure (wrong login)
}

</pre>
</div>

<p>
Cette routine permet de vérifier si l'utilisateur existe dans la base de données d'authentification avant de
vérifier si la signature (<i>hash</i>) du mot de passe fournit est identique à celle dans la base de données. En cas d'échec,
cette routine retourne 0. Par contre, si les informations fournies sont valides, cette routine retourne l'index
de l'emplacement des données de l'utilisateur dans la base de données des données utilisateur qui sera utilisé par
une autre routine qui s'occupera de charger, décrypter et afficher les données utilisateur.
</p>

<p>
À partir de cet exemple, on peut donc observer l'importance du hachage cryptographique dans la 'sécurisation' du stockage des données
utilisateur secrètes et de l'authentification. On peut même être amené à supposer que nous avons trouvé la solution au problème
et que notre système est protégé en cas de fuites. Supposition que plusieurs industriels et fournisseurs de services distants ont
considérée valide et qui leur a coûté, et à leurs utilisateurs, très cher par la suite.
</p>

<p>
Malheureusement, ce schéma de stockage ne protège pas les données des attaques de type <i>brute-force</i> basées sur un dictionnaire
de mots de passes ou sur des <i>rainbow tables</i>. Un attaquant avec suffisamment de resources de calcul et un dictionnaire bien élaboré
pourra venir à bout de plusieurs signatures en l'espace de quelques heures ou même quelques minutes. Pire encore, les mots de passes
similaires auront la même signature et il suffira de vérifier que la signature n'ait pas déjà été cassée, ce qui élimine tout calcul
redondant et accélère encore plus le processus de <i>brute-force</i>.
</p>

<p>
L'objectif de ce projet est donc d'analyser et d'optimiser les performances de l'outil <b>yHashCrack</b> qui permet
de 'casser' de façon parallèle des signatures de mots de passes pour un algorithme donné (<b>MD5</b>, <b>SHA1</b>, <b>SHA256</b>, &#x2026;) en utilisant
un dictionnaire.
</p>
</div>
</div>
