doc/README.org
** Algorithmes de hachage

   Comme cité préalablement, les algorithmes de hachage cryptographique doivent garantir l'unicité et la non réversibilité des signatures
   générées.
   
   Mathématiquement, une signature unique signifie que si: /*hash(a) = hash(b)*/, alors: /*a = b*/.
   Autrement, si: /*a != b*/ et /*hash(a) = hash(b)*/, nous parlons de collision entre /*a*/ et /*b*/.
   La non réversibilité de la signature consiste à garantir qu'il n'existe aucune fonction inverse *hash^-1* de la fonction
   de hachage *hash*. En d'autres termes, il devrait être impossible de retrouver /*a*/ en connaissant /*hash(a)*/:
   /*a = hash^-1(hash(a))*/ est impossible. Les fonctions de hachage sont aussi appelées /one-way-functions/. 

   Il existe plusieurs algorithmes de hachage cryptographique: *MD4, MD5, SHA1, SHA2, SHA3, CubeHash, BLAKE2,* ...
   Chaque algorithme présente des particularités différentes: taille de la signature, procédé de mélange des bits, ...
   qui lui permettent de garantir l'unicité et la non réversibilité des signatures générées, mais aussi une robustesse
   contre certaines attaques: /birthday attacks/, /timing attacks/, /cache timing attacks/, ... 
   
   Ces algorithmes de hachage sont généralement conçus et implémentés par des cryptographes et mathématiciens issus de plusieurs entitées:
   académiques, industrielles, militaires, surveillance et renseignement, ... et sont généralement standardisés
   et/ou certifiés et/ou recommandés par d'autres entités tels le *NIST* aux *USA*, ou l'*ANSSI* en *France*.
   
   Plusieurs de ces algorithmes de hachage sont aujourd'hui considérés comme obsolètes car il a été démontré qu'ils ne
   garantissaient plus l'unicité des signatures (existence de collisions). Par exemple, MD4, [[https://en.wikipedia.org/wiki/MD5][MD5]] et [[https://en.wikipedia.org/wiki/SHA-1][SHA1]] ne sont plus
   recommandés pour des usages cryptographiques car des collisions peuvent être générées à volonté et avec des moyens de calcul rudimentaires.
   
   Pour plus d'informations, se référer à la section [[Bonus crypto]].

* Comment fonctionne yHashCrack ?

  Afin de casser une signature, *yHashCrack* prend en paramètres de ligne de commande les éléments suivants:

  1. l'algorithme de hachage utilisé pour générer la signature cible: MD5, SHA1, SHA224, SHA256 ou SHA512
  2. le nombre de threads à utiliser pour chercher le mot de passe dans le dictionnaire
  3. l'emplacement du fichier dictionnaire contenant les potientiels mots de passes
  4. la signature cible à casser

  Ensuite, l'outil effectue les étapes suivantes:

  1. charger un block du dictionnaire
  2. découper le block du dictionnaire en sous-blocks et affecter à chaque sous-block un thread
  3. chaque thread exécute une boucle qui se déplace sur chaque entrée du dictionnaire, génère son /hash/ en utilisant la fonction de hachage
     choisie et le compare à la signature cible. Le code ci-dessous présente une implémentation du travail que doit effectuer chaque thread: 
     
     #+BEGIN_SRC c

       u64 crack_hash(ascii **dictionary, u64 num_dictionary_entries, u8 *target_hash)
       {
	 for (u64 i = 1; i <= num_dictionary_entries; i++)
	   {
	     u8 *entry_hash = hash(dictionary[i]);

	     if (compare(target_hash, hash) == 0)
	       return i; //Password found, return position in dictionary block
	   }

	 return 0; //Password not found
       }

     #+END_SRC

  4. si la signature est trouvée, le thread enregistre le mot de passe et signale avoir cassé le hash cible
  5. si aucun des threads ne trouve de mot de passe dont la signature correspond à la cible, et si le dictionnaire n'a pas été complètement chargé,
     retour à l'étape 1

  L'outil n'implémente pas directment les primitives de hachage, il utilise la librairie *yhash* qui fournit des implémentations valides mais
  non optimisées de: MD5, SHA1, SH224, SHA256 et SHA512.
  
* Travail à faire

  Sur le cluster *OB-1* vous avez à votre disposition, dans le répértoire du projet  */scratch/students/users/shared/project1*:
  
  - le code source de *yHashCrack*
  - le code source de la librairie *yhash*
  - un fichier (*hashes.txt*) contenant des signatures SHA256 à cracker 
  - un dictionnaire (*dictionary.txt*) de 4.2GB contenant 400000000 de mots de passes avec un mot de passe par ligne 
  
** Analyse des performances

   Pour commencer, il vous faudra identifier les points chauds du programme (fonctions ou boucles) en utilisant un profileur (Linux perf, MAQAO, ...).
   Exemple avec Linux perf:

   #+BEGIN_SRC bash

     $ LD_LIBRARY_PATH=./yhash perf record ./yhashcrack sha256 32 ./passwords.txt HASH
     
   #+END_SRC

   Une fois l'exécution du programme terminée, vous pouvez consulter le rapport en utlisant la commande suivante dans le répertoire contenant
   le fichier *perf.data*:

   #+BEGIN_SRC bash

     $ perf report
     
   #+END_SRC
   
   Il vous faudra aussi comprendre ce que chaque point chaud effectue comme traitement afin de l'optimiser plus tard. À vue d'oeil, les opérations les
   plus coûteuses seront:
   
   - les I/Os disque pour lire le dictionnaire
   - le hachage des mots de passes du dictionnaire
   - la comparaison de la signature calculée avec la signature cible

   Le code fournit effectue déjà une mesure des performances rudimentaire en affichant le temps de chargement du block du dictionnaire et le temps
   qu'il a fallu pour hacher et comparer toutes les entrées du block. 

   Vous devrez donc mesurer le temps qu'il faut pour casser chaque hash du fichier *hashes.txt* et optimiser en suivant les recommandations de la section
   suivante afin de réduire ce temps.
   
** Optimisation

   Pour optimiser l'outil, tous les coups sont permis. Il vous faudra améliorer les performances des points chauds en vous assurant que l'implémentation
   utilisée tire profit des charactéristiques de l'architecture des noeuds de calcul à votre disposition. Par exemple, les noeuds *Haswell* disposent du jeu
   d'instructions *AVX2* qui permet d'effectuer des opérations sur des vecteurs de 256-bits (32 octets) dont l'opération de comparaison des signatures pourrait
   bénéficier.
   Vous pouvez aussi remplacer les appels aux primitives de *yhash* par une autre librairie plus performante (*OpenSSL*, *NaCl*, *libsodium*, ...) ou
   implémenter vous même une version plus optimale en assembleur. Le code qui effectue le chargement des mots de passes en mémoire (I/O) peut aussi être amélioré.
   Comme cité avant: tous les coups sont permis. L'objectif étant de réduire le plus possible le temps qu'il faut pour casser les signatures fournies.
   
