doc/README.html

<div id="outline-container-org119a143" class="outline-3">
<h3 id="org119a143"><span class="section-number-3">1.2.</span> Algorithmes de hachage</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Comme cité préalablement, les algorithmes de hachage cryptographique doivent garantir l'unicité et la non réversibilité des signatures
générées.
</p>

<p>
Mathématiquement, une signature unique signifie que si: <i><b>hash(a) = hash(b)</b></i>, alors: <i><b>a = b</b></i>.
Autrement, si: <i><b>a != b</b></i> et <i><b>hash(a) = hash(b)</b></i>, nous parlons de collision entre <i><b>a</b></i> et <i><b>b</b></i>.
La non réversibilité de la signature consiste à garantir qu'il n'existe aucune fonction inverse <b>hash<sup>-1</sup></b> de la fonction
de hachage <b>hash</b>. En d'autres termes, il devrait être impossible de retrouver <i><b>a</b></i> en connaissant <i><b>hash(a)</b></i>:
<i><b>a = hash<sup>-1</sup>(hash(a))</b></i> est impossible. Les fonctions de hachage sont aussi appelées <i>one-way-functions</i>. 
</p>

<p>
Il existe plusieurs algorithmes de hachage cryptographique: <b>MD4, MD5, SHA1, SHA2, SHA3, CubeHash, BLAKE2,</b> &#x2026;
Chaque algorithme présente des particularités différentes: taille de la signature, procédé de mélange des bits, &#x2026;
qui lui permettent de garantir l'unicité et la non réversibilité des signatures générées, mais aussi une robustesse
contre certaines attaques: <i>birthday attacks</i>, <i>timing attacks</i>, <i>cache timing attacks</i>, &#x2026; 
</p>

<p>
Ces algorithmes de hachage sont généralement conçus et implémentés par des cryptographes et mathématiciens issus de plusieurs entitées:
académiques, industrielles, militaires, surveillance et renseignement, &#x2026; et sont généralement standardisés
et/ou certifiés et/ou recommandés par d'autres entités tels le <b>NIST</b> aux <b>USA</b>, ou l'<b>ANSSI</b> en <b>France</b>.
</p>

<p>
Plusieurs de ces algorithmes de hachage sont aujourd'hui considérés comme obsolètes car il a été démontré qu'ils ne
garantissaient plus l'unicité des signatures (existence de collisions). Par exemple, MD4, <a href="https://en.wikipedia.org/wiki/MD5">MD5</a> et <a href="https://en.wikipedia.org/wiki/SHA-1">SHA1</a> ne sont plus
recommandés pour des usages cryptographiques car des collisions peuvent être générées à volonté et avec des moyens de calcul rudimentaires.
</p>

<p>
Pour plus d'informations, se référer à la section <a href="#org908c7dd">6</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org7a7fd1f" class="outline-2">
<h2 id="org7a7fd1f"><span class="section-number-2">2.</span> Comment fonctionne yHashCrack ?</h2>
<div class="outline-text-2" id="text-2">
<p>
Afin de casser une signature, <b>yHashCrack</b> prend en paramètres de ligne de commande les éléments suivants:
</p>

<ol class="org-ol">
<li>l'algorithme de hachage utilisé pour générer la signature cible: MD5, SHA1, SHA224, SHA256 ou SHA512</li>
<li>le nombre de threads à utiliser pour chercher le mot de passe dans le dictionnaire</li>
<li>l'emplacement du fichier dictionnaire contenant les potientiels mots de passes</li>
<li>la signature cible à casser</li>
</ol>

<p>
Ensuite, l'outil effectue les étapes suivantes:
</p>

<ol class="org-ol">
<li>charger un block du dictionnaire</li>
<li>découper le block du dictionnaire en sous-blocks et affecter à chaque sous-block un thread</li>
<li><p>
chaque thread exécute une boucle qui se déplace sur chaque entrée du dictionnaire, génère son <i>hash</i> en utilisant la fonction de hachage
choisie et le compare à la signature cible. Le code ci-dessous présente une implémentation du travail que doit effectuer chaque thread: 
</p>

<div class="org-src-container">
<pre class="src src-c">
u64 crack_hash(ascii **dictionary, u64 num_dictionary_entries, u8 *target_hash)
{
  for (u64 i = 1; i &lt;= num_dictionary_entries; i++)
    {
      u8 *entry_hash = hash(dictionary[i]);

      if (compare(target_hash, hash) == 0)
        return i; //Password found, return position in dictionary block
    }

  return 0; //Password not found
}

</pre>
</div></li>

<li>si la signature est trouvée, le thread enregistre le mot de passe et signale avoir cassé le hash cible</li>
<li>si aucun des threads ne trouve de mot de passe dont la signature correspond à la cible, et si le dictionnaire n'a pas été complètement chargé,
retour à l'étape 1</li>
</ol>

<p>
L'outil n'implémente pas directment les primitives de hachage, il utilise la librairie <b>yhash</b> qui fournit des implémentations valides mais
non optimisées de: MD5, SHA1, SH224, SHA256 et SHA512.
</p>
</div>
</div>

<div id="outline-container-org1f8ccb4" class="outline-2">
<h2 id="org1f8ccb4"><span class="section-number-2">3.</span> Travail à faire</h2>
<div class="outline-text-2" id="text-3">
<p>
Sur le cluster <b>OB-1</b> vous avez à votre disposition, dans le répértoire du projet  <b>/scratch/students/users/shared/project1</b>:
</p>

<ul class="org-ul">
<li>le code source de <b>yHashCrack</b></li>
<li>le code source de la librairie <b>yhash</b></li>
<li>un fichier (<b>hashes.txt</b>) contenant des signatures SHA256 à cracker</li>
<li>un dictionnaire (<b>dictionary.txt</b>) de 4.2GB contenant 400000000 de mots de passes avec un mot de passe par ligne</li>
</ul>
</div>

<div id="outline-container-org03c9a11" class="outline-3">
<h3 id="org03c9a11"><span class="section-number-3">3.1.</span> Analyse des performances</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Pour commencer, il vous faudra identifier les points chauds du programme (fonctions ou boucles) en utilisant un profileur (Linux perf, MAQAO, &#x2026;).
Exemple avec Linux perf:
</p>

<div class="org-src-container">
<pre class="src src-bash">
$ LD_LIBRARY_PATH=./yhash perf record ./yhashcrack sha256 32 ./passwords.txt HASH

</pre>
</div>

<p>
Une fois l'exécution du programme terminée, vous pouvez consulter le rapport en utlisant la commande suivante dans le répertoire contenant
le fichier <b>perf.data</b>:
</p>

<div class="org-src-container">
<pre class="src src-bash">
$ perf report

</pre>
</div>

<p>
Il vous faudra aussi comprendre ce que chaque point chaud effectue comme traitement afin de l'optimiser plus tard. À vue d'oeil, les opérations les
plus coûteuses seront:
</p>

<ul class="org-ul">
<li>les I/Os disque pour lire le dictionnaire</li>
<li>le hachage des mots de passes du dictionnaire</li>
<li>la comparaison de la signature calculée avec la signature cible</li>
</ul>

<p>
Le code fournit effectue déjà une mesure des performances rudimentaire en affichant le temps de chargement du block du dictionnaire et le temps
qu'il a fallu pour hacher et comparer toutes les entrées du block. 
</p>

<p>
Vous devrez donc mesurer le temps qu'il faut pour casser chaque hash du fichier <b>hashes.txt</b> et optimiser en suivant les recommandations de la section
suivante afin de réduire ce temps.
</p>
</div>
</div>

<div id="outline-container-org8691d73" class="outline-3">
<h3 id="org8691d73"><span class="section-number-3">3.2.</span> Optimisation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Pour optimiser l'outil, tous les coups sont permis. Il vous faudra améliorer les performances des points chauds en vous assurant que l'implémentation
utilisée tire profit des charactéristiques de l'architecture des noeuds de calcul à votre disposition. Par exemple, les noeuds <b>Haswell</b> disposent du jeu
d'instructions <b>AVX2</b> qui permet d'effectuer des opérations sur des vecteurs de 256-bits (32 octets) dont l'opération de comparaison des signatures pourrait
bénéficier.
Vous pouvez aussi remplacer les appels aux primitives de <b>yhash</b> par une autre librairie plus performante (<b>OpenSSL</b>, <b>NaCl</b>, <b>libsodium</b>, &#x2026;) ou
implémenter vous même une version plus optimale en assembleur. Le code qui effectue le chargement des mots de passes en mémoire (I/O) peut aussi être amélioré.
Comme cité avant: tous les coups sont permis. L'objectif étant de réduire le plus possible le temps qu'il faut pour casser les signatures fournies.
</p>
</div>
</div>
</div>
