doc/README.org
* Rendu

  Il vous faudra fournir un rapport (au format PDF) détaillant les performances de la version fournie pour chacun des hashes du fichier *hashes.txt* et proposant des
  améliorations basées sur les résultats obtenus. Après avoir diagnostiqué l'application et proposé vos solutions, il vous faudra fournir le code d'une
  implémentation qui effectue les opérations nécessaires pour casser les hashes fournis de manière plus rapide que la version de base. Il vous faudra présenter
  les résultats des performances de cette version et les comparer à ceux de la version de base afin d'évaluer le /speedup/ (ou le /slowdown/) résultant des
  transformations du code.
  
  Notez que les performances de votre code seront comparées à celles d'une version optimisée par mes soins pour les noeuds Haswell du cluster.
  Un classement des codes les plus rapides sera aussi effectué après la correction de tous les projets. L'étudiant, ou l'étudiante, dont le code présentera des
  performances similaires ou meilleures que celles de ma version aura *20/20* en projet d'*Architectures Parallèles*.  
  
* Conseils

  - Breathe deep and RTFM!
    
  - Si vous n'avez pas accès au cluster *OB-1*, assurez-vous de:
    1. connecter votre laptop au secteur pour éviter le bruit du au *DVFS* (*Dynamic Voltage and Frequency Scaling*)
    2. fixer la fréquence de votre CPU en utilisant la commande *cpupower* suivante:

       #+BEGIN_SRC bash

	 $ cpupower -c all frequency-set -g performance
	 
       #+END_SRC

    3. assurez-vous de n'avoir aucun programme (firefox, chrome, ...) qui bruite vos mesures

  - Rappelez-vous que le plus important dans un article Wikipedia, ce sont les références!
    
* Bonus crypto
** Reality check & rainbow tables

   Comme vous l'avez bien compris, utiliser uniquement le hash d'un mot de passe n'est pas une solution fiable pour sécuriser les informations d'une base de données
   d'authentification et ce, pour plusieurs raisons:

   - Primo, les utilisateurs ayant le même mot de passe auront le même /hash/ dans la base de données.
   - Secundo, une attaque par dictionnaire finira tôt ou tard par casser certains hashes et permettre à un attaquant d'usurper l'identité d'utilisateurs légitimes.

   Une des optimisations possibles du processus de /brute-force/ est de créer des /rainbow tables/ qui contiennent les hashes précalculés de toutes les entrées du dictionnaire. 
   Ces tables sont généralement générées /*offline*/ et seront utilisées plus tard en cas de fuite afin de plus rapidement vérifier si les signatures des mots de passes qui ont
   fuités ne figurent pas dedans. Cette technique permet d'éviter de calculer le hash /*online*/, c'est-à-dire au moment de la recherche, et de transformer le problème en un
   simple /database lookup/ beaucoup plus rapide. En d'autres termes, un simple *=grep -i LEAKED_HASH rainbow_table.csv=* suffira à vérifier si un mot de passe existe
   pour cette signature. 
   
   Une /rainbow table/ ressemble généralement au format suivant (CSV) avec plusieurs hashes précalculés:
   
   #+BEGIN_EXAMPLE

     [password] [MD5 hash] [SHA1 hash] [SHA256 hash] ...
      toto;      09A5...;   78BC...;    140B...;
      titi;      89BB...;   D3AD...;    C0D3...;
      ...
      
   #+END_EXAMPLE
   
   Afin de rendre le processus de /brute-force/ plus fastidieux, plusieurs techniques peuvent être mises en oeuvre. Les prochaines sections détaillent des procédés additionnels
   de sécurisation du stockage d'informations d'authentification qui permettent de protéger contre certaines attaques par dictionnaire pré-hashés: /rainbow tables/ et rendre
   le processus plus coûteux en terme de calcul.
   
** Salt

   Le /salt/ est une chaîne d'octets (généralement d'une longueur entre et 16 et 64 octets) générée aléatoirement par le serveur pour chaque utilisateur au moment de la création
   de son compte. Ce paramètre est concaténé au mot de passe saisi avant d'être passé dans une primitive de hachage (*hash(/password+salt/)*) pour générer la signature.
   Le /salt/ est généralement stocké dans la base de données d'authentification. Ci-dessous, un exemple du format d'une base de données d'authentification introduisant un /salt/: 
   
   #+BEGIN_EXAMPLE

      [index] [user_login] [user_salt] [user_password_hash (hash(password+salt)] [user_data_entry_index]
           1   yaspr        kjh$a_10... B98772AE...                               1
	   2   michel       j&8-Qg*\... 9D062139..                                29
	   3   john         l!0p-d34... A1F67378..                                1500
	   4   toto         18g<8091... DD61BC13...                               4
	     
   #+END_EXAMPLE

   Ci-dessous, la routine permettant d'authentifier un utilisateur en utilisant le /salt/ (ici, le symbole + dénote la concaténation):
   
   #+BEGIN_SRC c

     u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
     {
       u64 index = 0;

       if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
	 {
	   u8 *user_password_hash = hash(user_password + auth_tab[index]->user_salt);

	   if (compare(user_password_hash, auth_tab[index]->user_password_hash) == 0)
	     return auth_tab[index]->user_data_entry_index;
	   else
	     return 0; //Login failure (wrong password)
	 }
       else
	 return 0; //Login failure (wrong login)
     }

   #+END_SRC

   Comme vous l'avez probablement déduit, le rajout du /salt/ permet de randomiser la signature pour chaque utilisateur évitant ainsi d'avoir la même signature pour
   des utilisateurs ayant le même mot de passe. Cette solution permet aussi de rendre obsolète tout précalcul de signatures d'un dictionnaire, l'attaquant ne
   disposant pas des /salts/ à l'avance. Ceci dit, cette solution reste toujours imparfaite face à la puissance de calcul disponible aujourd'hui. En réalité, lorsqu'une base
   de données d'authentification fuite, les /salts/ des utilisateurs ainsi que leurs hashes associés sont à la disposition de l'attaquant.
   Il lui suffit donc de revenir à un modèle d'attaque /online/ en utilisant plus de puissance de calcul (des GPUs ou FPGAs par exemple) pour réussir à casser certains mots
   de passes en utilisant un dictionnaire. 
   
