doc/README.html

<div id="outline-container-org629a16f" class="outline-2">
<h2 id="org629a16f"><span class="section-number-2">4.</span> Rendu</h2>
<div class="outline-text-2" id="text-4">
<p>
Il vous faudra fournir un rapport (au format PDF) détaillant les performances de la version fournie pour chacun des hashes du fichier <b>hashes.txt</b> et proposant des
améliorations basées sur les résultats obtenus. Après avoir diagnostiqué l'application et proposé vos solutions, il vous faudra fournir le code d'une
implémentation qui effectue les opérations nécessaires pour casser les hashes fournis de manière plus rapide que la version de base. Il vous faudra présenter
les résultats des performances de cette version et les comparer à ceux de la version de base afin d'évaluer le <i>speedup</i> (ou le <i>slowdown</i>) résultant des
transformations du code.
</p>

<p>
Notez que les performances de votre code seront comparées à celles d'une version optimisée par mes soins pour les noeuds Haswell du cluster.
Un classement des codes les plus rapides sera aussi effectué après la correction de tous les projets. L'étudiant, ou l'étudiante, dont le code présentera des
performances similaires ou meilleures que celles de ma version aura <b>20/20</b> en projet d'<b>Architectures Parallèles</b>.  
</p>
</div>
</div>

<div id="outline-container-org2faef44" class="outline-2">
<h2 id="org2faef44"><span class="section-number-2">5.</span> Conseils</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Breathe deep and RTFM!</li>

<li>Si vous n'avez pas accès au cluster <b>OB-1</b>, assurez-vous de:
<ol class="org-ol">
<li>connecter votre laptop au secteur pour éviter le bruit du au <b>DVFS</b> (<b>Dynamic Voltage and Frequency Scaling</b>)</li>
<li><p>
fixer la fréquence de votre CPU en utilisant la commande <b>cpupower</b> suivante:
</p>

<div class="org-src-container">
<pre class="src src-bash">
$ cpupower -c all frequency-set -g performance

</pre>
</div></li>

<li>assurez-vous de n'avoir aucun programme (firefox, chrome, &#x2026;) qui bruite vos mesures</li>
</ol></li>

<li>Rappelez-vous que le plus important dans un article Wikipedia, ce sont les références!</li>
</ul>
</div>
</div>

<div id="outline-container-org908c7dd" class="outline-2">
<h2 id="org908c7dd"><span class="section-number-2">6.</span> Bonus crypto</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga080e89" class="outline-3">
<h3 id="orga080e89"><span class="section-number-3">6.1.</span> Reality check &amp; rainbow tables</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Comme vous l'avez bien compris, utiliser uniquement le hash d'un mot de passe n'est pas une solution fiable pour sécuriser les informations d'une base de données
d'authentification et ce, pour plusieurs raisons:
</p>

<ul class="org-ul">
<li>Primo, les utilisateurs ayant le même mot de passe auront le même <i>hash</i> dans la base de données.</li>
<li>Secundo, une attaque par dictionnaire finira tôt ou tard par casser certains hashes et permettre à un attaquant d'usurper l'identité d'utilisateurs légitimes.</li>
</ul>

<p>
Une des optimisations possibles du processus de <i>brute-force</i> est de créer des <i>rainbow tables</i> qui contiennent les hashes précalculés de toutes les entrées du dictionnaire. 
Ces tables sont généralement générées <i><b>offline</b></i> et seront utilisées plus tard en cas de fuite afin de plus rapidement vérifier si les signatures des mots de passes qui ont
fuités ne figurent pas dedans. Cette technique permet d'éviter de calculer le hash <i><b>online</b></i>, c'est-à-dire au moment de la recherche, et de transformer le problème en un
simple <i>database lookup</i> beaucoup plus rapide. En d'autres termes, un simple <b><code>grep -i LEAKED_HASH rainbow_table.csv</code></b> suffira à vérifier si un mot de passe existe
pour cette signature. 
</p>

<p>
Une <i>rainbow table</i> ressemble généralement au format suivant (CSV) avec plusieurs hashes précalculés:
</p>

<pre class="example" id="orge4538e2">

[password] [MD5 hash] [SHA1 hash] [SHA256 hash] ...
 toto;      09A5...;   78BC...;    140B...;
 titi;      89BB...;   D3AD...;    C0D3...;
 ...

</pre>

<p>
Afin de rendre le processus de <i>brute-force</i> plus fastidieux, plusieurs techniques peuvent être mises en oeuvre. Les prochaines sections détaillent des procédés additionnels
de sécurisation du stockage d'informations d'authentification qui permettent de protéger contre certaines attaques par dictionnaire pré-hashés: <i>rainbow tables</i> et rendre
le processus plus coûteux en terme de calcul.
</p>
</div>
</div>

<div id="outline-container-orga29eca9" class="outline-3">
<h3 id="orga29eca9"><span class="section-number-3">6.2.</span> Salt</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Le <i>salt</i> est une chaîne d'octets (généralement d'une longueur entre et 16 et 64 octets) générée aléatoirement par le serveur pour chaque utilisateur au moment de la création
de son compte. Ce paramètre est concaténé au mot de passe saisi avant d'être passé dans une primitive de hachage (<b>hash(<i>password+salt</i>)</b>) pour générer la signature.
Le <i>salt</i> est généralement stocké dans la base de données d'authentification. Ci-dessous, un exemple du format d'une base de données d'authentification introduisant un <i>salt</i>: 
</p>

<pre class="example" id="org891bbc5">

[index] [user_login] [user_salt] [user_password_hash (hash(password+salt)] [user_data_entry_index]
     1   yaspr        kjh$a_10... B98772AE...                               1
     2   michel       j&amp;8-Qg*\... 9D062139..                                29
     3   john         l!0p-d34... A1F67378..                                1500
     4   toto         18g&lt;8091... DD61BC13...                               4

</pre>

<p>
Ci-dessous, la routine permettant d'authentifier un utilisateur en utilisant le <i>salt</i> (ici, le symbole + dénote la concaténation):
</p>

<div class="org-src-container">
<pre class="src src-c">
u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
{
  u64 index = 0;

  if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
    {
      u8 *user_password_hash = hash(user_password + auth_tab[index]-&gt;user_salt);

      if (compare(user_password_hash, auth_tab[index]-&gt;user_password_hash) == 0)
        return auth_tab[index]-&gt;user_data_entry_index;
      else
        return 0; //Login failure (wrong password)
    }
  else
    return 0; //Login failure (wrong login)
}

</pre>
</div>

<p>
Comme vous l'avez probablement déduit, le rajout du <i>salt</i> permet de randomiser la signature pour chaque utilisateur évitant ainsi d'avoir la même signature pour
des utilisateurs ayant le même mot de passe. Cette solution permet aussi de rendre obsolète tout précalcul de signatures d'un dictionnaire, l'attaquant ne
disposant pas des <i>salts</i> à l'avance. Ceci dit, cette solution reste toujours imparfaite face à la puissance de calcul disponible aujourd'hui. En réalité, lorsqu'une base
de données d'authentification fuite, les <i>salts</i> des utilisateurs ainsi que leurs hashes associés sont à la disposition de l'attaquant.
Il lui suffit donc de revenir à un modèle d'attaque <i>online</i> en utilisant plus de puissance de calcul (des GPUs ou FPGAs par exemple) pour réussir à casser certains mots
de passes en utilisant un dictionnaire. 
</p>
</div>
</div>
