doc/README.org
** Salt + pepper

   Le /salt/ n'étant pas suffisant à rendre la tâche impossible à un attaquant déterminé, le /pepper/ fut introduit pour ralentir encore plus les calculs de hashes en masse.
   Le /pepper/ est lui aussi une chaîne aléatoire d'octets générée par le serveur et qui permet de randomiser encore plus la signature produite par la fonction de hachage mais qui
   rajoute en plus une charge de calcul non négligeable. Si le /salt/ est entièrement concaténé au mot de passe saisi, seulement un caractère du /pepper/ sera aléatoirement choisi
   pour être concaténé au /salt/ et au mot de passe avant de générer une signature (*hash(/password+salt+pepper[?]/)*).

   Ci-dessous, un exemple d'une base de données intégrant le /salt/ ainsi que le /pepper/:
   
   #+BEGIN_EXAMPLE

      [index] [user_login] [user_salt] [user_pepper ] [user_password_hash hash(password+salt+pepper[?])] [user_data_entry_index]
           1   yaspr        kjh$a_10... $)98AZ...      C79072BC...                                        1
	   2   michel       j&8-Qg*\... 91@_1e...      E0012148..                                         29
	   3   john         l!0p-d34... %k~-\x...      81B68181..                                         1500
	   4   toto         18g<8091... l007&m...      01B1DC03...                                        4
	     
   #+END_EXAMPLE

   Ci-dessous, la routine permettant d'authentifier un utilisateur en prenant en compte le /salt/ et le /pepper/ (ici, le symbole + dénote la concaténation):
   
   #+BEGIN_SRC c

     u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
     {
       u8  found = 0;
       u64 index = 0;

       if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
	 {
	   for (u64 i = 0; !found && i < auth_tab[index]->pepper_length; i++)
	     {
	       u8 *user_password__hash = hash(user_password + auth_tab[index]->user_salt + auth_tab[index]->user_pepper[i]);

	       if (compare(user_password_hash, auth_tab[index]->user_password_hash) == 0)
		 found = 1;
	     }

	   if (found)
	     return auth_tab[index]->user_data_entry_index;
	   else
	     return 0; //Login failure (wrong password)
	 }
       else
	 return 0; //Login failure (wrong login)
     }

   #+END_SRC

   Comme vous pouvez le constater, casser des hashes qui ont été agrémentés de /salt/ et de /pepper/ n'est toujours pas une tâche impossible mais
   elle nécessitera un temps bien plus important et une puissance de calcul non négligeable.
   
** Autres techniques de stockage

   Il existe d'autres schémas de hachage de mots de passes sécurisés qui offrent la possibilité de définir plusieurs paramètres de robustesse.
   Par exemple, *OpenBSD*, ainsi que plusieurs distributions *Linux*, utilisent [[https://en.wikipedia.org/wiki/Bcrypt][bcrypt]] (parfois [[https://en.wikipedia.org/wiki/Scrypt][scrypt]]) afin de hacher les mots de passes et les protéger contre des
   attaques de type /brute-force/. La fonction *bcrypt* prend en paramètre un mot de passe (/password/), un coût (/c/) et un /salt/ (/s/), puis
   génère une signature en utilisant une variante de l'algorithme de chiffrement [[https://en.wikipedia.org/wiki/Blowfish_(cipher)][BlowFish]] répété /2^c/ fois. C'est cette répétition paramétrable qui
   offre donc une certaine robustesse contre les attaques de type /brute-force/ en rajoutant une charge de calcul importante: plusieurs milliers d'itérations
   interdépendentes qui appliquent une fonction de hachage de façon cyclique à chaque sortie.
   
   D'autres fonctions, par exemple *scrypt*, prennent en compte d'autres paramètres additionnels - comme l'empreinte mémoire - afin de rendre
   fastidieuse et très coûteuse la conception de circuits (/hardware/) spécialisés dans l'attaque de leurs signatures.
   
   Un autre algorithme, *Argon2*, fut le gagnant de la *Password Hashing Competition* (https://www.password-hashing.net/) organisée en 2013 pour sélectionner la méthode
   de stockage la plus sécurisée et la plus robuste contre des attaques de type /brute-force/ variées. *Argon2* utilise l'algorithme de hachage *BLAKE2* et prend en paramètres:

   - le temps d'exécution (/time cost/)
   - la consommation mémoire (/memory cost/)
   - le degré de parallélisme (/parallelism/) 

   Ces paramètres permettent à l'utilisateur de choisir la charge de travail adaptée à ses besoins. *Argon2* vient sous la forme de deux versions:

   - Argon2i : robuste contre les attaques par cannal auxiliaire (/side-channel attacks/)
   - Argon2d : plus robuste contre les attaques de type /brute-force/ utilisant des GPUs ou autres accélérateurs
   
   Pour plus d'informations sur le sujet, vous pouvez consulter les articles Wikipedia suivants:

   - [[https://en.wikipedia.org/wiki/PBKDF2][PBKDF2]]
   - [[https://en.wikipedia.org/wiki/Argon2][Argon2]]

** Comment chosir un mot de passe sécurisé?

   La robustesse d'un mot de passe dépend principalement de son imprédictibilité et donc de l'entropie des bits qui le constituent. L'entropie d'un mot de passe dépend de sa
   longueur et de la diversité des caractères utilisés et elle est exprimée comme suit: /H = log_2(N^L)/, avec /N/ représentant le nombre de symboles/caractères
   uniques pouvant constituer la chaîne et /L/ sa longueur. 
   
   En général, on se base sur les intervalles ci-dessous pour définir la robustesse d'un mot de passe:
   
   1.   0 -  28 bits: Niveau très faible
   2.  28 -  35 bits: Niveau faible
   3.  36 -  59 bits: Niveu raisonnable
   4.  60 - 127 bits: Robuste
   5. 128 - +oo bits: Très robuste
   
   Par exemple, pour la chaîne de caractères suivante: *=F(x)=Sin(2*x)-Cos(x*x)=*, l'entropie est de: 98.10 bits. On peut donc conclure que cette chaîne de caractères pourrait
   être utilisée comme un mot de passe robuste.
   
   Cette métrique n'est malheureusement pas fiable à elle seule. Par exemple,l'entropie de la chaîne suivante: 'aaaaaaaaaaaaaaaaaaaaaaaaaaaa', est de 134.6 bits.
   Comme vous l'avez bien compris, cette métrique n'est pas automatique. Pour garantir qu'un mot de passe est robuste, il faudra donc respecter des règles strictes liées à la
   longueur (au moins 13 caractères) ainsi que pour la diversité des caractères utilisés: minuscules, majuscules, symboles divers, ...
   
** Sécurité et comparaison des primitives

   - https://en.wikipedia.org/wiki/Hash_function_security_summary
   - https://en.wikipedia.org/wiki/Comparison_of_cryptographic_hash_functions
     
* Références

  - https://www.rfc-editor.org/rfc/rfc6234 
  - Secure Hash Standard: https://csrc.nist.gov/files/pubs/fips/180-2/final/docs/fips180-2.pdf
