doc/README.html

<div id="outline-container-org60f3fb1" class="outline-3">
<h3 id="org60f3fb1"><span class="section-number-3">6.3.</span> Salt + pepper</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Le <i>salt</i> n'étant pas suffisant à rendre la tâche impossible à un attaquant déterminé, le <i>pepper</i> fut introduit pour ralentir encore plus les calculs de hashes en masse.
Le <i>pepper</i> est lui aussi une chaîne aléatoire d'octets générée par le serveur et qui permet de randomiser encore plus la signature produite par la fonction de hachage mais qui
rajoute en plus une charge de calcul non négligeable. Si le <i>salt</i> est entièrement concaténé au mot de passe saisi, seulement un caractère du <i>pepper</i> sera aléatoirement choisi
pour être concaténé au <i>salt</i> et au mot de passe avant de générer une signature (<b>hash(<i>password+salt+pepper[?]</i>)</b>).
</p>

<p>
Ci-dessous, un exemple d'une base de données intégrant le <i>salt</i> ainsi que le <i>pepper</i>:
</p>

<pre class="example" id="orgeb3d7ff">

[index] [user_login] [user_salt] [user_pepper ] [user_password_hash hash(password+salt+pepper[?])] [user_data_entry_index]
     1   yaspr        kjh$a_10... $)98AZ...      C79072BC...                                        1
     2   michel       j&amp;8-Qg*\... 91@_1e...      E0012148..                                         29
     3   john         l!0p-d34... %k~-\x...      81B68181..                                         1500
     4   toto         18g&lt;8091... l007&amp;m...      01B1DC03...                                        4

</pre>

<p>
Ci-dessous, la routine permettant d'authentifier un utilisateur en prenant en compte le <i>salt</i> et le <i>pepper</i> (ici, le symbole + dénote la concaténation):
</p>

<div class="org-src-container">
<pre class="src src-c">
u64 authenticate_user(authentication_table **auth_tab, ascii *user_login, u8 user_password)
{
  u8  found = 0;
  u64 index = 0;

  if ((index = lookup_user_by_login(auth_tab, user_login) != 0))
    {
      for (u64 i = 0; !found &amp;&amp; i &lt; auth_tab[index]-&gt;pepper_length; i++)
        {
          u8 *user_password__hash = hash(user_password + auth_tab[index]-&gt;user_salt + auth_tab[index]-&gt;user_pepper[i]);

          if (compare(user_password_hash, auth_tab[index]-&gt;user_password_hash) == 0)
            found = 1;
        }

      if (found)
        return auth_tab[index]-&gt;user_data_entry_index;
      else
        return 0; //Login failure (wrong password)
    }
  else
    return 0; //Login failure (wrong login)
}

</pre>
</div>

<p>
Comme vous pouvez le constater, casser des hashes qui ont été agrémentés de <i>salt</i> et de <i>pepper</i> n'est toujours pas une tâche impossible mais
elle nécessitera un temps bien plus important et une puissance de calcul non négligeable.
</p>
</div>
</div>

<div id="outline-container-orgb2d00a8" class="outline-3">
<h3 id="orgb2d00a8"><span class="section-number-3">6.4.</span> Autres techniques de stockage</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Il existe d'autres schémas de hachage de mots de passes sécurisés qui offrent la possibilité de définir plusieurs paramètres de robustesse.
Par exemple, <b>OpenBSD</b>, ainsi que plusieurs distributions <b>Linux</b>, utilisent <a href="https://en.wikipedia.org/wiki/Bcrypt">bcrypt</a> (parfois <a href="https://en.wikipedia.org/wiki/Scrypt">scrypt</a>) afin de hacher les mots de passes et les protéger contre des
attaques de type <i>brute-force</i>. La fonction <b>bcrypt</b> prend en paramètre un mot de passe (<i>password</i>), un coût (<i>c</i>) et un <i>salt</i> (<i>s</i>), puis
génère une signature en utilisant une variante de l'algorithme de chiffrement <a href="https://en.wikipedia.org/wiki/Blowfish_(cipher)">BlowFish</a> répété <i>2<sup>c</sup></i> fois. C'est cette répétition paramétrable qui
offre donc une certaine robustesse contre les attaques de type <i>brute-force</i> en rajoutant une charge de calcul importante: plusieurs milliers d'itérations
interdépendentes qui appliquent une fonction de hachage de façon cyclique à chaque sortie.
</p>

<p>
D'autres fonctions, par exemple <b>scrypt</b>, prennent en compte d'autres paramètres additionnels - comme l'empreinte mémoire - afin de rendre
fastidieuse et très coûteuse la conception de circuits (<i>hardware</i>) spécialisés dans l'attaque de leurs signatures.
</p>

<p>
Un autre algorithme, <b>Argon2</b>, fut le gagnant de la <b>Password Hashing Competition</b> (<a href="https://www.password-hashing.net/">https://www.password-hashing.net/</a>) organisée en 2013 pour sélectionner la méthode
de stockage la plus sécurisée et la plus robuste contre des attaques de type <i>brute-force</i> variées. <b>Argon2</b> utilise l'algorithme de hachage <b>BLAKE2</b> et prend en paramètres:
</p>

<ul class="org-ul">
<li>le temps d'exécution (<i>time cost</i>)</li>
<li>la consommation mémoire (<i>memory cost</i>)</li>
<li>le degré de parallélisme (<i>parallelism</i>)</li>
</ul>

<p>
Ces paramètres permettent à l'utilisateur de choisir la charge de travail adaptée à ses besoins. <b>Argon2</b> vient sous la forme de deux versions:
</p>

<ul class="org-ul">
<li>Argon2i : robuste contre les attaques par cannal auxiliaire (<i>side-channel attacks</i>)</li>
<li>Argon2d : plus robuste contre les attaques de type <i>brute-force</i> utilisant des GPUs ou autres accélérateurs</li>
</ul>

<p>
Pour plus d'informations sur le sujet, vous pouvez consulter les articles Wikipedia suivants:
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/PBKDF2">PBKDF2</a></li>
<li><a href="https://en.wikipedia.org/wiki/Argon2">Argon2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc3de268" class="outline-3">
<h3 id="orgc3de268"><span class="section-number-3">6.5.</span> Comment chosir un mot de passe sécurisé?</h3>
<div class="outline-text-3" id="text-6-5">
<p>
La robustesse d'un mot de passe dépend principalement de son imprédictibilité et donc de l'entropie des bits qui le constituent. L'entropie d'un mot de passe dépend de sa
longueur et de la diversité des caractères utilisés et elle est exprimée comme suit: <i>H = log<sub>2</sub>(N<sup>L</sup>)</i>, avec <i>N</i> représentant le nombre de symboles/caractères
uniques pouvant constituer la chaîne et <i>L</i> sa longueur. 
</p>

<p>
En général, on se base sur les intervalles ci-dessous pour définir la robustesse d'un mot de passe:
</p>

<ol class="org-ol">
<li>0 -  28 bits: Niveau très faible</li>
<li>28 -  35 bits: Niveau faible</li>
<li>36 -  59 bits: Niveu raisonnable</li>
<li>60 - 127 bits: Robuste</li>
<li>128 - +oo bits: Très robuste</li>
</ol>

<p>
Par exemple, pour la chaîne de caractères suivante: <b><code>F(x)=Sin(2*x)-Cos(x*x)</code></b>, l'entropie est de: 98.10 bits. On peut donc conclure que cette chaîne de caractères pourrait
être utilisée comme un mot de passe robuste.
</p>

<p>
Cette métrique n'est malheureusement pas fiable à elle seule. Par exemple,l'entropie de la chaîne suivante: 'aaaaaaaaaaaaaaaaaaaaaaaaaaaa', est de 134.6 bits.
Comme vous l'avez bien compris, cette métrique n'est pas automatique. Pour garantir qu'un mot de passe est robuste, il faudra donc respecter des règles strictes liées à la
longueur (au moins 13 caractères) ainsi que pour la diversité des caractères utilisés: minuscules, majuscules, symboles divers, &#x2026;
</p>
</div>
</div>

<div id="outline-container-org54677a2" class="outline-3">
<h3 id="org54677a2"><span class="section-number-3">6.6.</span> Sécurité et comparaison des primitives</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Hash_function_security_summary">https://en.wikipedia.org/wiki/Hash_function_security_summary</a></li>
<li><a href="https://en.wikipedia.org/wiki/Comparison_of_cryptographic_hash_functions">https://en.wikipedia.org/wiki/Comparison_of_cryptographic_hash_functions</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4125ee9" class="outline-2">
<h2 id="org4125ee9"><span class="section-number-2">7.</span> Références</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://www.rfc-editor.org/rfc/rfc6234">https://www.rfc-editor.org/rfc/rfc6234</a></li>
<li>Secure Hash Standard: <a href="https://csrc.nist.gov/files/pubs/fips/180-2/final/docs/fips180-2.pdf">https://csrc.nist.gov/files/pubs/fips/180-2/final/docs/fips180-2.pdf</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yaspr</p>
<p class="date">Created: 2024-01-08 Mon 11:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>